import UIKit

var greeting = "Hello, playground"
//입력의 첫 줄에는 테스트 케이스의 개수 T가 주어진다. 그 다음 줄부터 각각의 테스트 케이스에 대해 첫째 줄에는 배추를 심은 배추밭의 가로길이 M(1 ≤ M ≤ 50)과 세로길이 N(1 ≤ N ≤ 50), 그리고 배추가 심어져 있는 위치의 개수 K(1 ≤ K ≤ 2500)이 주어진다. 그 다음 K줄에는 배추의 위치 X(0 ≤ X ≤ M-1), Y(0 ≤ Y ≤ N-1)가 주어진다. 두 배추의 위치가 같은 경우는 없다.
/*
 2
 10 8 17
 0 0
 1 0
 1 1
 4 2
 4 3
 4 5
 2 4
 3 4
 7 4
 8 4
 9 4
 7 5
 8 5
 9 5
 7 6
 8 6
 9 6
 10 10 1
 5 5
 */


func solution(){
    var T = 2
    var M = 10 // 가로
    var N = 8 // 세로
    var K = 17
    var arr = [
        [0, 0],
        [1, 0],
        [1, 1],
        [4, 2],
        [4, 3],
        [4, 5],
        [2, 4],
        [3, 4],
        [7, 4],
        [8, 4],
        [9, 4],
        [7, 5],
        [8, 5],
        [9, 5],
        [7, 6],
        [8, 6],
        [9, 6]
    ]
    
}
